''''GIT -  это система контроля версий (записывает изменения файла или набора файла в течении времени)
Предназначен для отслеживания ведения истории изменений файлов в проекте. Благодоря ему, можем вернуть старую
версию программы '''

'''github - это сайт, предлогает услуги по хранению репозиториев и управления доступом'''

'''' команды'''
# git init - это иницализация нашего объекта и создание папки .git(в ней содержаться все необхадимые файлы нашего 
# репозитория)

# git add (./ <filename) - добовляет файлы с рабочей дириктории в промежуточное пространство - индекс (спейиальное
# промежуточное пространство, в котором хранятся изменения файлов на пути от рабочей папки до репозитороия)

# git commit - добавляет все файлы которые находятся в индексе во внутреннюю базу данных и сохраняет их состояние на данный 
# момент

# git remote add origin url(https or ssh) - добовляет удаленный репозиторий который находится на каком нибудь сервере

# git push -u origin <branch name> - отправка кода в удаленный репозиторий

# git branch - показывает список веток

# git branch <branch name> - создает ветку с названием <branch name>

# git checkout <branch name> - переключает на ветку <branch name>

# git pull origin <branchname> - стягиваем изменения с ветки <branch name> к себе на локалку

# git status - показывает статус проекта

# git log - журнал коммитов

# git clone ссылка_на _удаленный_репозиторий- склонировать\скопировать\скачать удаленный_репозитрий
# 

